In [1]:
import pandas as pd
pd.set_option('display.max_columns',10)
print("Original data:\n")
df=pd.read_excel("Students performance.xlsx")
print(df)

Original data:

       Name  English  Tamil  Maths  Science  Social  Total
0    Suresh     78.0     99     87       98      87    449
1    Suresh     99.0     35     44       65      76    319
2    Ramesh      NaN     43     34       56      77    210
3      Anil     78.0     99     87       98      87    449
4      Suni     99.0     35     44       65      76    319
5    Rajesh      NaN     43     34       56      77    210
6     Yuvan     78.0     99     87       98      87    449
7    Rajesh     99.0     35     44       65      76    319
8    Bhavan      NaN     43     34       56      77    210
9   Yuvaraj     78.0     99     87       98      87    449
10    Sunil     99.0     35     44       65      76    319
11   Ramesh      NaN     43     34       56      77    210
12   Murali      NaN     43     34       56      77    210
13     Lijo     78.0     99     87       98      87    449
14     Mani     99.0     35     44       65      76    319
15    Yuvan      NaN     43     34       56      77    210
16    Johan     78.0     99     87       98      87    449
17   Rajesh     99.0     35     44       65      76    319
18   Ramesh     99.0     35     44       65      76    319

In [3]:
f=df['Name'].str.strip()
f.to_excel("Students performance 1.xlsx")
print(f)

0      Suresh
1      Suresh
2      Ramesh
3        Anil
4        Suni
5      Rajesh
6       Yuvan
7      Rajesh
8      Bhavan
9     Yuvaraj
10      Sunil
11     Ramesh
12     Murali
13       Lijo
14       Mani
15      Yuvan
16      Johan
17     Rajesh
18     Ramesh
Name: Name, dtype: object

In [4]:
k=df.ffill()
print("\n Updated list\n")
k.to_excel("Students performance.xlsx")
print(k)

 Updated list

       Name  English  Tamil  Maths  Science  Social  Total
0    Suresh     78.0     99     87       98      87    449
1    Suresh     99.0     35     44       65      76    319
2    Ramesh     99.0     43     34       56      77    210
3      Anil     78.0     99     87       98      87    449
4      Suni     99.0     35     44       65      76    319
5    Rajesh     99.0     43     34       56      77    210
6     Yuvan     78.0     99     87       98      87    449
7    Rajesh     99.0     35     44       65      76    319
8    Bhavan     99.0     43     34       56      77    210
9   Yuvaraj     78.0     99     87       98      87    449
10    Sunil     99.0     35     44       65      76    319
11   Ramesh     99.0     43     34       56      77    210
12   Murali     99.0     43     34       56      77    210
13     Lijo     78.0     99     87       98      87    449
14     Mani     99.0     35     44       65      76    319
15    Yuvan     99.0     43     34       56      77    210
16    Johan     78.0     99     87       98      87    449
17   Rajesh     99.0     35     44       65      76    319
18   Ramesh     99.0     35     44       65      76    319

In [5]:
print("\n Drop One Particular column and its values")
k.drop(['Tamil'],axis=1,inplace=True)
print("\n updated list \n")
k.to_excel("Students performance.xlsx")
print(k)

 Drop One Particular column and its values

 updated list

       Name  English  Maths  Science  Social  Total
0    Suresh     78.0     87       98      87    449
1    Suresh     99.0     44       65      76    319
2    Ramesh     99.0     34       56      77    210
3      Anil     78.0     87       98      87    449
4      Suni     99.0     44       65      76    319
5    Rajesh     99.0     34       56      77    210
6     Yuvan     78.0     87       98      87    449
7    Rajesh     99.0     44       65      76    319
8    Bhavan     99.0     34       56      77    210
9   Yuvaraj     78.0     87       98      87    449
10    Sunil     99.0     44       65      76    319
11   Ramesh     99.0     34       56      77    210
12   Murali     99.0     34       56      77    210
13     Lijo     78.0     87       98      87    449
14     Mani     99.0     44       65      76    319
15    Yuvan     99.0     34       56      77    210
16    Johan     78.0     87       98      87    449
17   Rajesh     99.0     44       65      76    319
18   Ramesh     99.0     44       65      76    319

In [6]:
print("Drop Nan values\n")
k.dropna()
k.to_excel("Students performance.xlsx")
print(k)

Drop Nan values

       Name  English  Maths  Science  Social  Total
0    Suresh     78.0     87       98      87    449
1    Suresh     99.0     44       65      76    319
2    Ramesh     99.0     34       56      77    210
3      Anil     78.0     87       98      87    449
4      Suni     99.0     44       65      76    319
5    Rajesh     99.0     34       56      77    210
6     Yuvan     78.0     87       98      87    449
7    Rajesh     99.0     44       65      76    319
8    Bhavan     99.0     34       56      77    210
9   Yuvaraj     78.0     87       98      87    449
10    Sunil     99.0     44       65      76    319
11   Ramesh     99.0     34       56      77    210
12   Murali     99.0     34       56      77    210
13     Lijo     78.0     87       98      87    449
14     Mani     99.0     44       65      76    319
15    Yuvan     99.0     34       56      77    210
16    Johan     78.0     87       98      87    449
17   Rajesh     99.0     44       65      76    319
18   Ramesh     99.0     44       65      76    319

In [7]:
print("\n Replace values\n")
n=pd.read_excel("Students performance.xlsx")
print("Original dataframe")
print(n)
y=n.replace({99:56})
print("Replaced values\n")
print(y)

 Replace values

Original dataframe
    Unnamed: 0     Name  English  Maths  Science  Social  Total
0            0   Suresh       78     87       98      87    449
1            1   Suresh       99     44       65      76    319
2            2   Ramesh       99     34       56      77    210
3            3     Anil       78     87       98      87    449
4            4     Suni       99     44       65      76    319
5            5   Rajesh       99     34       56      77    210
6            6    Yuvan       78     87       98      87    449
7            7   Rajesh       99     44       65      76    319
8            8   Bhavan       99     34       56      77    210
9            9  Yuvaraj       78     87       98      87    449
10          10    Sunil       99     44       65      76    319
11          11   Ramesh       99     34       56      77    210
12          12   Murali       99     34       56      77    210
13          13     Lijo       78     87       98      87    449
14          14     Mani       99     44       65      76    319
15          15    Yuvan       99     34       56      77    210
16          16    Johan       78     87       98      87    449
17          17   Rajesh       99     44       65      76    319
18          18   Ramesh       99     44       65      76    319
Replaced values

    Unnamed: 0     Name  English  Maths  Science  Social  Total
0            0   Suresh       78     87       98      87    449
1            1   Suresh       56     44       65      76    319
2            2   Ramesh       56     34       56      77    210
3            3     Anil       78     87       98      87    449
4            4     Suni       56     44       65      76    319
5            5   Rajesh       56     34       56      77    210
6            6    Yuvan       78     87       98      87    449
7            7   Rajesh       56     44       65      76    319
8            8   Bhavan       56     34       56      77    210
9            9  Yuvaraj       78     87       98      87    449
10          10    Sunil       56     44       65      76    319
11          11   Ramesh       56     34       56      77    210
12          12   Murali       56     34       56      77    210
13          13     Lijo       78     87       98      87    449
14          14     Mani       56     44       65      76    319
15          15    Yuvan       56     34       56      77    210
16          16    Johan       78     87       98      87    449
17          17   Rajesh       56     44       65      76    319
18          18   Ramesh       56     44       65      76    319

In [8]:
df=pd.read_excel("Students performance.xlsx")
print(df)
print("Extracting using isin() function\n")
new=df["Total"].isin([210])
print(df[new])

    Unnamed: 0     Name  English  Maths  Science  Social  Total
0            0   Suresh       78     87       98      87    449
1            1   Suresh       99     44       65      76    319
2            2   Ramesh       99     34       56      77    210
3            3     Anil       78     87       98      87    449
4            4     Suni       99     44       65      76    319
5            5   Rajesh       99     34       56      77    210
6            6    Yuvan       78     87       98      87    449
7            7   Rajesh       99     44       65      76    319
8            8   Bhavan       99     34       56      77    210
9            9  Yuvaraj       78     87       98      87    449
10          10    Sunil       99     44       65      76    319
11          11   Ramesh       99     34       56      77    210
12          12   Murali       99     34       56      77    210
13          13     Lijo       78     87       98      87    449
14          14     Mani       99     44       65      76    319
15          15    Yuvan       99     34       56      77    210
16          16    Johan       78     87       98      87    449
17          17   Rajesh       99     44       65      76    319
18          18   Ramesh       99     44       65      76    319
Extracting using isin() function

    Unnamed: 0    Name  English  Maths  Science  Social  Total
2            2  Ramesh       99     34       56      77    210
5            5  Rajesh       99     34       56      77    210
8            8  Bhavan       99     34       56      77    210
11          11  Ramesh       99     34       56      77    210
12          12  Murali       99     34       56      77    210
15          15   Yuvan       99     34       56      77    210